app/controllers/api/v1/facts_controller.rb

    def create
      @fact = @user.facts.new(fact_params)

      if @fact.save
---
INSERT INTO "facts" ("user_id", "fact", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["fact", "Remember who you wanted to be."], ["likes", 13], ["created_at", "2024-04-29 07:26:40.415603"], ["updated_at", "2024-04-29 07:26:40.415603"]]

    def update
      if @fact.update(fact_params)
---
UPDATE "facts" SET "likes" = ?, "updated_at" = ? WHERE "facts"."id" = ?  [["likes", 20], ["updated_at", "2024-04-29 08:02:39.741473"], ["id", 1]]

    def destroy
      @fact.destroy
---
DELETE FROM "facts" WHERE "facts"."id" = ?  [["id", 2]]

      def set_fact
        # debugger
        @fact = @user.facts.find(params[:id])
---
SELECT "facts".* FROM "facts" WHERE "facts"."user_id" = ? AND "facts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]