app/controllers/api/v1/users_controller.rb

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "[FILTERED]"], ["updated_at", "2024-04-29 07:14:04.130845"], ["id", 2]]
---
  def update
    if @user.update(user_params)